# Лимарев Степан ИУ7-11Б. Программа предназначена для определения принадлежности точки заданной области.


# Ввод исходных данных.
x = float(input("Введите значение координаты x: "))
y = float(input("Введите значение координаты y: "))


# Вычисления.
flag = False

if x >= -9:

    if x < -8:

        if 7 * (x + 8) ** 2 + 1 <= y <= -1/8 * (x + 9) ** 2 + 8:
            flag = True

    elif x <= -2:

        if 1/3 * (x + 5) ** 2 - 7 <= y <= -1/16 * x ** 2 or 1/49 * (x + 1) ** 2 <= y <= -1/8 * (x + 9) ** 2 + 8:
            flag = True

    elif x < -1:

        if any((-2 * (x + 1) ** 2 - 2 <= y <= -1/16 * x ** 2,
                1/49 * (x + 1) ** 2 <= y <= -1/8 * (x + 9) ** 2 + 8,
                y == -3/2 * x + 2)):
            flag = True

    elif x == -1:

        if -2 <= y <= 0 or y == 3.5:
            flag = True

    elif x <= 0:

        if 4 * x ** 2 - 6 <= y <= -4 * x ** 2 + 2 or y == -3/2 * x + 2:
            flag = True

    elif x < 1:

        if 4 * x ** 2 - 6 <= y <= -4 * x ** 2 + 2 or y == 3/2 * x + 2:
            flag = True

    elif x == 1:

        if -2 <= y <= 0 or y == 3.5:
            flag = True

    elif x <= 2:

        if any((-2 * (x - 1) ** 2 - 2 <= y <= -1/16 * x ** 2,
                1/49 * (x - 1) ** 2 <= y <= -1/8 * (x - 9) ** 2 + 8,
                y == 3/2 * x + 2)):
            flag = True

    elif x <= 8:

        if 1/3 * (x - 5) ** 2 - 7 <= y <= -1/16 * x ** 2 or 1/49 * (x - 1) ** 2 <= y <= -1/8 * (x - 9) ** 2 + 8:
            flag = True

    elif x <= 9:

        if 7 * (x - 8) ** 2 + 1 <= y <= -1/8 * (x - 9) ** 2 + 8:
            flag = True


# Вывод.
print('Точка принадлежит заданной области.' if flag else "Точка не принадлежит заданной области.")